; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Freecell is a solitaire game that comes with Windows.
;;; If you haven't seen it before:
;;;  One has 8 columns of cards, 4 freecells and 4 homecells. The
;;;  cards start in "random" (random according to MS's brain damaged RNG)
;;;  piles in the 8 columns. We can move a card in the following ways: 
;;;  1. we can move any card that is on top of a column to an empty free
;;;     cell. The free cells only take one card each.
;;;  2. we can move any card from a free cell or from top of a column to
;;;  a home cell if that home cell contains a card of the same suit
;;;  and is one lower in value (aces have value 1, Jacks 11, Queens
;;;  12, Kings 13), and to make things more symmetric we start the
;;;  homecells off containing "phone" cards with value 0.
;;;  3. we can move any card from the  top of a column or from a
;;;  freecell to the top of another column if that column currently holds
;;;  a card with an opposite colour suit that has one higher
;;;  value. 
;;;  4. we can move any card from a free cell or on top of a column to a
;;;  new column if there are less than 8 columns.
;;; The aim is to get all of the card home. The problems show quite a
;;; good variety of difficulty. 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain freecell)
  (:requirements :strips :typing)
  (:types card colnum cellnum num suit)
  (:predicates (on ?c1 - card ?c2 - card)
	       (incell ?c - card)
	       (clear ?c - card)
	       (cellspace ?n - cellnum)
	       (colspace ?n - colnum)
	       (home ?c - card)
	       (bottomcol ?c - card)
	       (canstack ?c1 - card ?c2 - card)
	       (hassuit ?c - card ?s - suit)
	       (value ?c - card ?v - num)
	       (successor ?n1 - num ?n0 - num)
	       (colsuccessor ?n1 - colnum ?n0 - colnum)
	       (cellsuccessor ?n1 - cellnum ?n0 - cellnum)
 )

;;; Move card between columns. Two versions dependent on whether or
;;; not we generate a new stack.

  (:action move
	   :parameters (?card ?oldcard ?newcard - card)
	   :precondition (and (clear ?card)
			      (clear ?newcard)
			      (canstack ?card ?newcard)
			      (on ?card ?oldcard))
	   :effect (and
		    (on ?card ?newcard)
		    (clear ?oldcard)
		    (not (on ?card ?oldcard))
		    (not (clear ?newcard))))

  (:action move-b
	   :parameters (?card ?newcard - card ?cols ?ncols - colnum)
	   :precondition (and (clear ?card)
			      (bottomcol ?card)
			      (clear ?newcard)
			      (canstack ?card ?newcard)
			      (colspace ?cols)
			      (colsuccessor ?ncols ?cols))
	   :effect (and (on ?card ?newcard)
			(colspace ?ncols)
			(not (bottomcol ?card))
			(not (clear ?newcard))
			(not (colspace ?cols))))

;; Send a card to a freecell. Two versions dependent on whether or not
;; we generate a new stack.

  (:action sendtofree
	   :parameters (?card ?oldcard - card ?cells ?ncells - cellnum)
	   :precondition (and
			  (clear ?card)
			  (on ?card ?oldcard)
			  (cellspace ?cells)
			  (cellsuccessor ?cells ?ncells))
	   :effect (and
		    (incell ?card)
		    (clear ?oldcard)
		    (cellspace ?ncells)
		    (not (on ?card ?oldcard))
		    (not (clear ?card))
		    (not (cellspace ?cells))))

  (:action sendtofree-b
	   :parameters (?card - card ?cells ?ncells - cellnum ?cols ?ncols - colnum)
	   :precondition (and (clear ?card)
			      (bottomcol ?card)
			      (cellspace ?cells)
			      (cellsuccessor ?cells ?ncells)
			      (colspace ?cols)
			      (colsuccessor ?ncols ?cols))
	   :effect (and
		    (incell ?card)
		    (colspace ?ncols)
		    (cellspace ?ncells)
		    (not (bottomcol ?card))
		    (not (clear ?card))
		    (not (colspace ?cols))
		    (not (cellspace ?cells))))

;; Send a card a new column

(:action sendtonewcol
	 :parameters (?card ?oldcard - card ?cols ?ncols - colnum)
	 :precondition (and
			(clear ?card)
			(colspace ?cols)
			(colsuccessor ?cols ?ncols)
			(on ?card ?oldcard))
	 :effect (and
		  (bottomcol ?card)
		  (clear ?oldcard)
		  (colspace ?ncols)
		  (not (on ?card ?oldcard))
		  (not (colspace ?cols))))

;;Send a card home

(:action sendtohome
	 :parameters (?card ?oldcard - card ?suitname - suit ?vcard - num
			    ?homecard - card ?vhomecard - num)
	 :precondition (and
			(clear ?card)
			(on ?card ?oldcard)
			(home ?homecard)
			(hassuit ?card ?suitname)
			(hassuit ?homecard ?suitname)
			(value ?card ?vcard)
			(value ?homecard ?vhomecard)
			(successor ?vcard ?vhomecard))
	 :effect (and (home ?card)
		      (clear ?oldcard)
		      (not (on ?card ?oldcard))
                      (not (home ?homecard))
		      (not (clear ?card))))

(:action sendtohome-b
	 :parameters (?card - card ?suitname - suit  ?vcard - num
			    ?homecard - card
			    ?vhomecard - num
			    ?cols ?ncols - colnum)
	 :precondition (and (clear ?card)
			    (bottomcol ?card)
			    (home ?homecard)
			    (hassuit ?card ?suitname)
			    (hassuit ?homecard ?suitname)
			    (value ?card ?vcard)
			    (value ?homecard ?vhomecard)
			    (successor ?vcard ?vhomecard)
			    (colspace ?cols)
			    (colsuccessor ?ncols ?cols))
	 :effect (and (home ?card)
		      (colspace ?ncols)
		      (not (home ?homecard))
		      (not (clear ?card))
		      (not (bottomcol ?card))
		      (not (colspace ?cols))))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Move cards in free cell
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(:action homefromfreecell
	 :parameters (?card - card ?suitname - suit ?vcard - num
			    ?homecard - card ?vhomecard - num
			    ?cells ?ncells - cellnum)
    ;;Send a card home from a free cell.
	 :precondition (and
			(incell ?card)
			(home ?homecard)
			(hassuit ?card ?suitname)
			(hassuit ?homecard ?suitname)
			(value ?card ?vcard)
			(value ?homecard ?vhomecard)
			(successor ?vcard ?vhomecard)
			(cellspace ?cells)
			(cellsuccessor ?ncells ?cells))
	 :effect (and
		  (home ?card)
		  (cellspace ?ncells)
		  (not (incell ?card))
		  (not (cellspace ?cells))
		  (not (home ?homecard))))

(:action colfromfreecell
	 :parameters (?card ?newcard -  card ?cells ?ncells - cellnum)
	 :precondition (and  (incell ?card)
			     (clear ?newcard)
			     (canstack ?card ?newcard)
			     (cellspace ?cells)
			     (cellsuccessor ?ncells ?cells))
	 :effect (and (cellspace ?ncells)
		      (clear ?card)
		      (on ?card ?newcard)
		      (not (incell ?card))
		      (not (cellspace ?cells))
		      (not (clear ?newcard))))

(:action newcolfromfreecell
	 :parameters (?card - card ?cols ?ncols - colnum ?cells ?ncells - cellnum)
	 :precondition (and (incell ?card)
			    (colspace ?cols)
			    (cellspace ?cells)
			    (colsuccessor ?cols ?ncols)
			    (cellsuccessor ?ncells ?cells))
	 :effect (and (bottomcol ?card)
		      (clear ?card)
		      (colspace ?ncols)
		      (cellspace ?ncells)
		      (not (incell ?card))
		      (not (colspace ?cols))
		      (not (cellspace ?cells)))))

; problem
(define (problem freecell-f4-c9-s4-i9-012-112-212-312
)(:domain freecell)
(:objects 
          c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 c12
          h0 h1 h2 h3 h4 h5 h6 h7 h8 h9 h10 h11 h12
          s0 s1 s2 s3 s4 s5 s6 s7 s8 s9 s10 s11 s12
          d0 d1 d2 d3 d4 d5 d6 d7 d8 d9 d10 d11 d12
 - card
          celln0 celln1 celln2 celln3 celln4 
 - cellnum
          coln0 coln1 coln2 coln3 coln4 coln5 coln6 coln7 coln8 coln9 
 - colnum
          n0 n1 n2 n3 n4 n5 n6 n7 n8 n9 n10 n11 n12 
 - num
           c h s d
 - suit
)
(:init
(value c0 n0)
(value c1 n1)
(value c2 n2)
(value c3 n3)
(value c4 n4)
(value c5 n5)
(value c6 n6)
(value c7 n7)
(value c8 n8)
(value c9 n9)
(value c10 n10)
(value c11 n11)
(value c12 n12)
(value h0 n0)
(value h1 n1)
(value h2 n2)
(value h3 n3)
(value h4 n4)
(value h5 n5)
(value h6 n6)
(value h7 n7)
(value h8 n8)
(value h9 n9)
(value h10 n10)
(value h11 n11)
(value h12 n12)
(value s0 n0)
(value s1 n1)
(value s2 n2)
(value s3 n3)
(value s4 n4)
(value s5 n5)
(value s6 n6)
(value s7 n7)
(value s8 n8)
(value s9 n9)
(value s10 n10)
(value s11 n11)
(value s12 n12)
(value d0 n0)
(value d1 n1)
(value d2 n2)
(value d3 n3)
(value d4 n4)
(value d5 n5)
(value d6 n6)
(value d7 n7)
(value d8 n8)
(value d9 n9)
(value d10 n10)
(value d11 n11)
(value d12 n12)
(cellsuccessor celln1 celln0)
(cellsuccessor celln2 celln1)
(cellsuccessor celln3 celln2)
(cellsuccessor celln4 celln3)
(colsuccessor coln1 coln0)
(colsuccessor coln2 coln1)
(colsuccessor coln3 coln2)
(colsuccessor coln4 coln3)
(colsuccessor coln5 coln4)
(colsuccessor coln6 coln5)
(colsuccessor coln7 coln6)
(colsuccessor coln8 coln7)
(colsuccessor coln9 coln8)
(successor n1 n0)
(successor n2 n1)
(successor n3 n2)
(successor n4 n3)
(successor n5 n4)
(successor n6 n5)
(successor n7 n6)
(successor n8 n7)
(successor n9 n8)
(successor n10 n9)
(successor n11 n10)
(successor n12 n11)
(hassuit c0 c)
(hassuit c1 c)
(hassuit c2 c)
(hassuit c3 c)
(hassuit c4 c)
(hassuit c5 c)
(hassuit c6 c)
(hassuit c7 c)
(hassuit c8 c)
(hassuit c9 c)
(hassuit c10 c)
(hassuit c11 c)
(hassuit c12 c)
(hassuit h0 h)
(hassuit h1 h)
(hassuit h2 h)
(hassuit h3 h)
(hassuit h4 h)
(hassuit h5 h)
(hassuit h6 h)
(hassuit h7 h)
(hassuit h8 h)
(hassuit h9 h)
(hassuit h10 h)
(hassuit h11 h)
(hassuit h12 h)
(hassuit s0 s)
(hassuit s1 s)
(hassuit s2 s)
(hassuit s3 s)
(hassuit s4 s)
(hassuit s5 s)
(hassuit s6 s)
(hassuit s7 s)
(hassuit s8 s)
(hassuit s9 s)
(hassuit s10 s)
(hassuit s11 s)
(hassuit s12 s)
(hassuit d0 d)
(hassuit d1 d)
(hassuit d2 d)
(hassuit d3 d)
(hassuit d4 d)
(hassuit d5 d)
(hassuit d6 d)
(hassuit d7 d)
(hassuit d8 d)
(hassuit d9 d)
(hassuit d10 d)
(hassuit d11 d)
(hassuit d12 d)
(canstack c2 h3)
(canstack c2 d3)
(canstack c3 h4)
(canstack c3 d4)
(canstack c4 h5)
(canstack c4 d5)
(canstack c5 h6)
(canstack c5 d6)
(canstack c6 h7)
(canstack c6 d7)
(canstack c7 h8)
(canstack c7 d8)
(canstack c8 h9)
(canstack c8 d9)
(canstack c9 h10)
(canstack c9 d10)
(canstack c10 h11)
(canstack c10 d11)
(canstack c11 h12)
(canstack c11 d12)
(canstack h2 c3)
(canstack h2 s3)
(canstack h3 c4)
(canstack h3 s4)
(canstack h4 c5)
(canstack h4 s5)
(canstack h5 c6)
(canstack h5 s6)
(canstack h6 c7)
(canstack h6 s7)
(canstack h7 c8)
(canstack h7 s8)
(canstack h8 c9)
(canstack h8 s9)
(canstack h9 c10)
(canstack h9 s10)
(canstack h10 c11)
(canstack h10 s11)
(canstack h11 c12)
(canstack h11 s12)
(canstack s2 h3)
(canstack s2 d3)
(canstack s3 h4)
(canstack s3 d4)
(canstack s4 h5)
(canstack s4 d5)
(canstack s5 h6)
(canstack s5 d6)
(canstack s6 h7)
(canstack s6 d7)
(canstack s7 h8)
(canstack s7 d8)
(canstack s8 h9)
(canstack s8 d9)
(canstack s9 h10)
(canstack s9 d10)
(canstack s10 h11)
(canstack s10 d11)
(canstack s11 h12)
(canstack s11 d12)
(canstack d2 c3)
(canstack d2 s3)
(canstack d3 c4)
(canstack d3 s4)
(canstack d4 c5)
(canstack d4 s5)
(canstack d5 c6)
(canstack d5 s6)
(canstack d6 c7)
(canstack d6 s7)
(canstack d7 c8)
(canstack d7 s8)
(canstack d8 c9)
(canstack d8 s9)
(canstack d9 c10)
(canstack d9 s10)
(canstack d10 c11)
(canstack d10 s11)
(canstack d11 c12)
(canstack d11 s12)
(home c0)
(home h0)
(home s0)
(home d0)
(cellspace celln4)
(colspace coln0)

(bottomcol d4)
(on d8 d4)
(on c3 d8)
(on c5 c3)
(on h3 c5)
(clear h3)

(bottomcol h2)
(on c6 h2)
(on h5 c6)
(on d10 h5)
(clear d10)

(bottomcol s2)
(on s3 s2)
(on c9 s3)
(on s6 c9)
(on c2 s6)
(on d9 c2)
(clear d9)

(bottomcol s7)
(on c12 s7)
(on h7 c12)
(on d7 h7)
(on d6 d7)
(on c7 d6)
(on s8 c7)
(clear s8)

(bottomcol c11)
(on s9 c11)
(on d2 s9)
(on s10 d2)
(on s11 s10)
(clear s11)

(bottomcol c1)
(on s1 c1)
(on s5 s1)
(on h12 s5)
(on s12 h12)
(clear s12)

(bottomcol d11)
(on h11 d11)
(on h10 h11)
(on d3 h10)
(clear d3)

(bottomcol h8)
(on s4 h8)
(on h9 s4)
(on d1 h9)
(on h4 d1)
(clear h4)

(bottomcol h6)
(on c4 h6)
(on h1 c4)
(on c10 h1)
(on d12 c10)
(on c8 d12)
(on d5 c8)
(clear d5)
)
(:goal
(and
(home c12)
(home h12)
(home s12)
(home d12)
)
)
)

; plan
1. (sendtofree h4 d1 celln4 celln3)
   deleted: (on h4 d1) (clear h4) (cellspace celln4)
   added: (incell h4) (clear d1) (cellspace celln3)
   goals met: 0 of 4
2. (sendtohome d1 h9 d n1 d0 n0)
   deleted: (on d1 h9) (home d0) (clear d1)
   added: (home d1) (clear h9)
   goals met: 0 of 4
3. (sendtofree d9 c2 celln3 celln2)
   deleted: (on d9 c2) (clear d9) (cellspace celln3)
   added: (incell d9) (clear c2) (cellspace celln2)
   goals met: 0 of 4
4. (sendtofree d3 h10 celln2 celln1)
   deleted: (on d3 h10) (clear d3) (cellspace celln2)
   added: (incell d3) (clear h10) (cellspace celln1)
   goals met: 0 of 4
5. (sendtofree h9 s4 celln1 celln0)
   deleted: (on h9 s4) (clear h9) (cellspace celln1)
   added: (incell h9) (clear s4) (cellspace celln0)
   goals met: 0 of 4
6. (move s4 h8 d5)
   deleted: (on s4 h8) (clear d5)
   added: (on s4 d5) (clear h8)
   goals met: 0 of 4
7. (move h3 c5 s4)
   deleted: (on h3 c5) (clear s4)
   added: (on h3 s4) (clear c5)
   goals met: 0 of 4
8. (move c2 s6 h3)
   deleted: (on c2 s6) (clear h3)
   added: (on c2 h3) (clear s6)
   goals met: 0 of 4
9. (colfromfreecell h4 c5 celln0 celln1)
   deleted: (incell h4) (cellspace celln0) (clear c5)
   added: (cellspace celln1) (clear h4) (on h4 c5)
   goals met: 0 of 4
10. (sendtofree s6 c9 celln1 celln0)
   deleted: (on s6 c9) (clear s6) (cellspace celln1)
   added: (incell s6) (clear c9) (cellspace celln0)
   goals met: 0 of 4
11. (move c9 s3 d10)
   deleted: (on c9 s3) (clear d10)
   added: (on c9 d10) (clear s3)
   goals met: 0 of 4
12. (move-b h8 c9 coln0 coln1)
   deleted: (bottomcol h8) (clear c9) (colspace coln0)
   added: (on h8 c9) (colspace coln1)
   goals met: 0 of 4
13. (sendtonewcol s11 s10 coln1 coln0)
   deleted: (on s11 s10) (colspace coln1)
   added: (bottomcol s11) (clear s10) (colspace coln0)
   goals met: 0 of 4
14. (move h10 h11 s11)
   deleted: (on h10 h11) (clear s11)
   added: (on h10 s11) (clear h11)
   goals met: 0 of 4
15. (move s10 d2 h11)
   deleted: (on s10 d2) (clear h11)
   added: (on s10 h11) (clear d2)
   goals met: 0 of 4
16. (sendtohome d2 s9 d n2 d1 n1)
   deleted: (on d2 s9) (home d1) (clear d2)
   added: (home d2) (clear s9)
   goals met: 0 of 4
17. (move s3 s2 h4)
   deleted: (on s3 s2) (clear h4)
   added: (on s3 h4) (clear s2)
   goals met: 0 of 4
18. (homefromfreecell d3 d n3 d2 n2 celln0 celln1)
   deleted: (incell d3) (cellspace celln0) (home d2)
   added: (home d3) (cellspace celln1)
   goals met: 0 of 4
19. (sendtofree s3 h4 celln1 celln0)
   deleted: (on s3 h4) (clear s3) (cellspace celln1)
   added: (incell s3) (clear h4) (cellspace celln0)
   goals met: 0 of 4
20. (colfromfreecell d9 s10 celln0 celln1)
   deleted: (incell d9) (cellspace celln0) (clear s10)
   added: (cellspace celln1) (clear d9) (on d9 s10)
   goals met: 0 of 4
21. (sendtofree c2 h3 celln1 celln0)
   deleted: (on c2 h3) (clear c2) (cellspace celln1)
   added: (incell c2) (clear h3) (cellspace celln0)
   goals met: 0 of 4
22. (move-b s2 h3 coln0 coln1)
   deleted: (bottomcol s2) (clear h3) (colspace coln0)
   added: (on s2 h3) (colspace coln1)
   goals met: 0 of 4
23. (move s8 c7 d9)
   deleted: (on s8 c7) (clear d9)
   added: (on s8 d9) (clear c7)
   goals met: 0 of 4
24. (move c7 d6 h8)
   deleted: (on c7 d6) (clear h8)
   added: (on c7 h8) (clear d6)
   goals met: 0 of 4
25. (move d6 d7 c7)
   deleted: (on d6 d7) (clear c7)
   added: (on d6 c7) (clear d7)
   goals met: 0 of 4
26. (move d7 h7 s8)
   deleted: (on d7 h7) (clear s8)
   added: (on d7 s8) (clear h7)
   goals met: 0 of 4
27. (sendtonewcol h7 c12 coln1 coln0)
   deleted: (on h7 c12) (colspace coln1)
   added: (bottomcol h7) (clear c12) (colspace coln0)
   goals met: 0 of 4
28. (move s9 c11 h10)
   deleted: (on s9 c11) (clear h10)
   added: (on s9 h10) (clear c11)
   goals met: 0 of 4
29. (colfromfreecell s6 d7 celln0 celln1)
   deleted: (incell s6) (cellspace celln0) (clear d7)
   added: (cellspace celln1) (clear s6) (on s6 d7)
   goals met: 0 of 4
30. (sendtofree h4 c5 celln1 celln0)
   deleted: (on h4 c5) (clear h4) (cellspace celln1)
   added: (incell h4) (clear c5) (cellspace celln0)
   goals met: 0 of 4
31. (move c5 c3 d6)
   deleted: (on c5 c3) (clear d6)
   added: (on c5 d6) (clear c3)
   goals met: 0 of 4
32. (colfromfreecell h4 c5 celln0 celln1)
   deleted: (incell h4) (cellspace celln0) (clear c5)
   added: (cellspace celln1) (clear h4) (on h4 c5)
   goals met: 0 of 4
33. (sendtofree c3 d8 celln1 celln0)
   deleted: (on c3 d8) (clear c3) (cellspace celln1)
   added: (incell c3) (clear d8) (cellspace celln0)
   goals met: 0 of 4
34. (move d8 d4 s9)
   deleted: (on d8 d4) (clear s9)
   added: (on d8 s9) (clear d4)
   goals met: 0 of 4
35. (sendtohome-b d4 d n4 d3 n3 coln0 coln1)
   deleted: (home d3) (clear d4) (bottomcol d4) (colspace coln0)
   added: (home d4) (colspace coln1)
   goals met: 0 of 4
36. (sendtonewcol c12 s7 coln1 coln0)
   deleted: (on c12 s7) (colspace coln1)
   added: (bottomcol c12) (clear s7) (colspace coln0)
   goals met: 0 of 4
37. (colfromfreecell c3 h4 celln0 celln1)
   deleted: (incell c3) (cellspace celln0) (clear h4)
   added: (cellspace celln1) (clear c3) (on c3 h4)
   goals met: 0 of 4
38. (sendtofree s12 h12 celln1 celln0)
   deleted: (on s12 h12) (clear s12) (cellspace celln1)
   added: (incell s12) (clear h12) (cellspace celln0)
   goals met: 0 of 4
39. (move-b s7 d8 coln0 coln1)
   deleted: (bottomcol s7) (clear d8) (colspace coln0)
   added: (on s7 d8) (colspace coln1)
   goals met: 0 of 4
40. (sendtonewcol h12 s5 coln1 coln0)
   deleted: (on h12 s5) (colspace coln1)
   added: (bottomcol h12) (clear s5) (colspace coln0)
   goals met: 0 of 4
41. (move-b c11 h12 coln0 coln1)
   deleted: (bottomcol c11) (clear h12) (colspace coln0)
   added: (on c11 h12) (colspace coln1)
   goals met: 0 of 4
42. (sendtonewcol s5 s1 coln1 coln0)
   deleted: (on s5 s1) (colspace coln1)
   added: (bottomcol s5) (clear s1) (colspace coln0)
   goals met: 0 of 4
43. (sendtohome s1 c1 s n1 s0 n0)
   deleted: (on s1 c1) (home s0) (clear s1)
   added: (home s1) (clear c1)
   goals met: 0 of 4
44. (sendtohome-b c1 c n1 c0 n0 coln0 coln1)
   deleted: (home c0) (clear c1) (bottomcol c1) (colspace coln0)
   added: (home c1) (colspace coln1)
   goals met: 0 of 4
45. (homefromfreecell c2 c n2 c1 n1 celln0 celln1)
   deleted: (incell c2) (cellspace celln0) (home c1)
   added: (home c2) (cellspace celln1)
   goals met: 0 of 4
46. (sendtohome s2 h3 s n2 s1 n1)
   deleted: (on s2 h3) (home s1) (clear s2)
   added: (home s2) (clear h3)
   goals met: 0 of 4
47. (homefromfreecell s3 s n3 s2 n2 celln1 celln2)
   deleted: (incell s3) (cellspace celln1) (home s2)
   added: (home s3) (cellspace celln2)
   goals met: 0 of 4
48. (sendtohome c3 h4 c n3 c2 n2)
   deleted: (on c3 h4) (home c2) (clear c3)
   added: (home c3) (clear h4)
   goals met: 0 of 4
49. (sendtofree h3 s4 celln2 celln1)
   deleted: (on h3 s4) (clear h3) (cellspace celln2)
   added: (incell h3) (clear s4) (cellspace celln1)
   goals met: 0 of 4
50. (sendtohome s4 d5 s n4 s3 n3)
   deleted: (on s4 d5) (home s3) (clear s4)
   added: (home s4) (clear d5)
   goals met: 0 of 4
51. (sendtohome d5 c8 d n5 d4 n4)
   deleted: (on d5 c8) (home d4) (clear d5)
   added: (home d5) (clear c8)
   goals met: 0 of 4
52. (sendtohome-b s5 s n5 s4 n4 coln1 coln2)
   deleted: (home s4) (clear s5) (bottomcol s5) (colspace coln1)
   added: (home s5) (colspace coln2)
   goals met: 0 of 4
53. (sendtofree h4 c5 celln1 celln0)
   deleted: (on h4 c5) (clear h4) (cellspace celln1)
   added: (incell h4) (clear c5) (cellspace celln0)
   goals met: 0 of 4
54. (sendtonewcol c5 d6 coln2 coln1)
   deleted: (on c5 d6) (colspace coln2)
   added: (bottomcol c5) (clear d6) (colspace coln1)
   goals met: 0 of 4
55. (sendtohome d6 c7 d n6 d5 n5)
   deleted: (on d6 c7) (home d5) (clear d6)
   added: (home d6) (clear c7)
   goals met: 0 of 4
56. (sendtohome s6 d7 s n6 s5 n5)
   deleted: (on s6 d7) (home s5) (clear s6)
   added: (home s6) (clear d7)
   goals met: 0 of 4
57. (sendtohome s7 d8 s n7 s6 n6)
   deleted: (on s7 d8) (home s6) (clear s7)
   added: (home s7) (clear d8)
   goals met: 0 of 4
58. (sendtohome d7 s8 d n7 d6 n6)
   deleted: (on d7 s8) (home d6) (clear d7)
   added: (home d7) (clear s8)
   goals met: 0 of 4
59. (sendtohome s8 d9 s n8 s7 n7)
   deleted: (on s8 d9) (home s7) (clear s8)
   added: (home s8) (clear d9)
   goals met: 0 of 4
60. (sendtohome d8 s9 d n8 d7 n7)
   deleted: (on d8 s9) (home d7) (clear d8)
   added: (home d8) (clear s9)
   goals met: 0 of 4
61. (sendtohome s9 h10 s n9 s8 n8)
   deleted: (on s9 h10) (home s8) (clear s9)
   added: (home s9) (clear h10)
   goals met: 0 of 4
62. (sendtohome d9 s10 d n9 d8 n8)
   deleted: (on d9 s10) (home d8) (clear d9)
   added: (home d9) (clear s10)
   goals met: 0 of 4
63. (sendtonewcol c8 d12 coln1 coln0)
   deleted: (on c8 d12) (colspace coln1)
   added: (bottomcol c8) (clear d12) (colspace coln0)
   goals met: 0 of 4
64. (sendtohome s10 h11 s n10 s9 n9)
   deleted: (on s10 h11) (home s9) (clear s10)
   added: (home s10) (clear h11)
   goals met: 0 of 4
65. (move h10 s11 c11)
   deleted: (on h10 s11) (clear c11)
   added: (on h10 c11) (clear s11)
   goals met: 0 of 4
66. (sendtohome-b s11 s n11 s10 n10 coln0 coln1)
   deleted: (home s10) (clear s11) (bottomcol s11) (colspace coln0)
   added: (home s11) (colspace coln1)
   goals met: 0 of 4
67. (sendtonewcol d12 c10 coln1 coln0)
   deleted: (on d12 c10) (colspace coln1)
   added: (bottomcol d12) (clear c10) (colspace coln0)
   goals met: 0 of 4
68. (homefromfreecell s12 s n12 s11 n11 celln0 celln1)
   deleted: (incell s12) (cellspace celln0) (home s11)
   added: (home s12) (cellspace celln1)
   goals met: 1 of 4
69. (move h11 d11 c12)
   deleted: (on h11 d11) (clear c12)
   added: (on h11 c12) (clear d11)
   goals met: 1 of 4
70. (move c10 h1 d11)
   deleted: (on c10 h1) (clear d11)
   added: (on c10 d11) (clear h1)
   goals met: 1 of 4
71. (sendtohome h1 c4 h n1 h0 n0)
   deleted: (on h1 c4) (home h0) (clear h1)
   added: (home h1) (clear c4)
   goals met: 1 of 4
72. (sendtohome c4 h6 c n4 c3 n3)
   deleted: (on c4 h6) (home c3) (clear c4)
   added: (home c4) (clear h6)
   goals met: 1 of 4
73. (sendtohome-b c5 c n5 c4 n4 coln0 coln1)
   deleted: (home c4) (clear c5) (bottomcol c5) (colspace coln0)
   added: (home c5) (colspace coln1)
   goals met: 1 of 4
74. (sendtofree c7 h8 celln1 celln0)
   deleted: (on c7 h8) (clear c7) (cellspace celln1)
   added: (incell c7) (clear h8) (cellspace celln0)
   goals met: 1 of 4
75. (sendtonewcol h8 c9 coln1 coln0)
   deleted: (on h8 c9) (colspace coln1)
   added: (bottomcol h8) (clear c9) (colspace coln0)
   goals met: 1 of 4
76. (move c9 d10 h10)
   deleted: (on c9 d10) (clear h10)
   added: (on c9 h10) (clear d10)
   goals met: 1 of 4
77. (sendtohome d10 h5 d n10 d9 n9)
   deleted: (on d10 h5) (home d9) (clear d10)
   added: (home d10) (clear h5)
   goals met: 1 of 4
78. (move-b h7 c8 coln0 coln1)
   deleted: (bottomcol h7) (clear c8) (colspace coln0)
   added: (on h7 c8) (colspace coln1)
   goals met: 1 of 4
79. (sendtonewcol h5 c6 coln1 coln0)
   deleted: (on h5 c6) (colspace coln1)
   added: (bottomcol h5) (clear c6) (colspace coln0)
   goals met: 1 of 4
80. (sendtohome c6 h2 c n6 c5 n5)
   deleted: (on c6 h2) (home c5) (clear c6)
   added: (home c6) (clear h2)
   goals met: 1 of 4
81. (sendtohome-b h2 h n2 h1 n1 coln0 coln1)
   deleted: (home h1) (clear h2) (bottomcol h2) (colspace coln0)
   added: (home h2) (colspace coln1)
   goals met: 1 of 4
82. (homefromfreecell h3 h n3 h2 n2 celln0 celln1)
   deleted: (incell h3) (cellspace celln0) (home h2)
   added: (home h3) (cellspace celln1)
   goals met: 1 of 4
83. (homefromfreecell h4 h n4 h3 n3 celln1 celln2)
   deleted: (incell h4) (cellspace celln1) (home h3)
   added: (home h4) (cellspace celln2)
   goals met: 1 of 4
84. (sendtohome-b h5 h n5 h4 n4 coln1 coln2)
   deleted: (home h4) (clear h5) (bottomcol h5) (colspace coln1)
   added: (home h5) (colspace coln2)
   goals met: 1 of 4
85. (sendtohome-b h6 h n6 h5 n5 coln2 coln3)
   deleted: (home h5) (clear h6) (bottomcol h6) (colspace coln2)
   added: (home h6) (colspace coln3)
   goals met: 1 of 4
86. (sendtohome h7 c8 h n7 h6 n6)
   deleted: (on h7 c8) (home h6) (clear h7)
   added: (home h7) (clear c8)
   goals met: 1 of 4
87. (sendtohome-b h8 h n8 h7 n7 coln3 coln4)
   deleted: (home h7) (clear h8) (bottomcol h8) (colspace coln3)
   added: (home h8) (colspace coln4)
   goals met: 1 of 4
88. (homefromfreecell c7 c n7 c6 n6 celln2 celln3)
   deleted: (incell c7) (cellspace celln2) (home c6)
   added: (home c7) (cellspace celln3)
   goals met: 1 of 4
89. (homefromfreecell h9 h n9 h8 n8 celln3 celln4)
   deleted: (incell h9) (cellspace celln3) (home h8)
   added: (home h9) (cellspace celln4)
   goals met: 1 of 4
90. (sendtohome-b c8 c n8 c7 n7 coln4 coln5)
   deleted: (home c7) (clear c8) (bottomcol c8) (colspace coln4)
   added: (home c8) (colspace coln5)
   goals met: 1 of 4
91. (sendtohome c9 h10 c n9 c8 n8)
   deleted: (on c9 h10) (home c8) (clear c9)
   added: (home c9) (clear h10)
   goals met: 1 of 4
92. (sendtohome h10 c11 h n10 h9 n9)
   deleted: (on h10 c11) (home h9) (clear h10)
   added: (home h10) (clear c11)
   goals met: 1 of 4
93. (sendtohome c10 d11 c n10 c9 n9)
   deleted: (on c10 d11) (home c9) (clear c10)
   added: (home c10) (clear d11)
   goals met: 1 of 4
94. (sendtohome-b d11 d n11 d10 n10 coln5 coln6)
   deleted: (home d10) (clear d11) (bottomcol d11) (colspace coln5)
   added: (home d11) (colspace coln6)
   goals met: 1 of 4
95. (sendtohome-b d12 d n12 d11 n11 coln6 coln7)
   deleted: (home d11) (clear d12) (bottomcol d12) (colspace coln6)
   added: (home d12) (colspace coln7)
   goals met: 2 of 4
96. (sendtohome c11 h12 c n11 c10 n10)
   deleted: (on c11 h12) (home c10) (clear c11)
   added: (home c11) (clear h12)
   goals met: 2 of 4
97. (sendtohome h11 c12 h n11 h10 n10)
   deleted: (on h11 c12) (home h10) (clear h11)
   added: (home h11) (clear c12)
   goals met: 2 of 4
98. (sendtohome-b c12 c n12 c11 n11 coln7 coln8)
   deleted: (home c11) (clear c12) (bottomcol c12) (colspace coln7)
   added: (home c12) (colspace coln8)
   goals met: 3 of 4
99. (sendtohome-b h12 h n12 h11 n11 coln8 coln9)
   deleted: (home h11) (clear h12) (bottomcol h12) (colspace coln8)
   added: (home h12) (colspace coln9)
   goals met: 4 of 4
